<b>1. Create connection to the mysql on localhost.<b>

In [2]:
import mysql.connector

con = mysql.connector.connect(host="localhost", user="root", password="amankhatri")

print("Connection = ",con)

con.close()

Connection =  <mysql.connector.connection_cext.CMySQLConnection object at 0x0000025CA990B6D0>

<b>2. List all the databases available in your system.</b>

In [6]:
from mysql.connector import connect, Error

try:
    con = connect(host="localhost",user="root",password="amankhatri")
    cursor = con.cursor()
    
    cursor.execute("SHOW DATABASES")

    for db in cursor:
        print(db)
        
    cursor.close()
    con.close()
except Error as e:
    print(e)

('apt',)
('batch2',)
('dbms',)
('information_schema',)
('mysql',)
('performance_schema',)
('s',)
('sys',)
('termwork',)
('test',)
('test1',)
('testing',)

<b>3. Create a database dbStudent. Connect to it.</b>

In [17]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri")
cursor = conn.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS dbStudent")
print("'dbStudent' database Created")
cursor.close()

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
print("Connected to 'dbStudent' database")

'dbStudent' database Created
Connected to 'dbStudent' database

<b>4.Create a table tblStudent with columns of suitable type: rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks,totalmarks, percentage and grade.</b>

In [18]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

create_table_query = """
    CREATE TABLE IF NOT EXISTS tblStudent (
        rollno INT PRIMARY KEY,
        name VARCHAR(255),
        birthdate DATE,
        gender ENUM('Male', 'Female', 'Other'),
        cmarks INT,
        cppmarks INT,
        pythonmarks INT,
        totalmarks INT,
        percentage DECIMAL(5, 2),
        grade CHAR(1)
    )
"""

cursor.execute(create_table_query)
conn.commit()
cursor.close()
conn.close()

print("Table 'tblStudent' created successfully.")

Table 'tblStudent' created successfully.

<b>5. Insert at least 10 rows (only rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks) into tblStudent. Use different ways for the same (as shown in various examples shown above).</b>

In [2]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

student_data = [
    (1, 'Aman Khatri', '2002-08-29', 'Male', 80, 85, 70),
    (2, 'Neha Mishra', '2000-03-28', 'Female', 75, 89, 95),
    (3, 'Rahul Jogadiya', '2001-07-27', 'Male', 90, 92, 88),
    (4, 'Payal Sharma', '1999-04-25', 'Female', 81, 89, 78),
    (5, 'Karan Garle', '2002-02-10', 'Male', 95, 83, 94),
    (6, 'Pooja Verma', '1999-07-18', 'Female', 84, 87, 85),
    (7, 'Virat Kohli', '1996-11-20', 'Male', 90, 92, 88),
    (8, 'Ankita Gandhi', '2000-05-08', 'Female', 71, 60, 72),
    (9, 'Jaivin Domadiya', '2001-08-12', 'Male', 88, 91, 84),
    (10, 'Anita Choudhary', '2000-01-05', 'Female', 82, 83, 87)
]

insert_query = """
    INSERT INTO tblStudent (rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks)
    VALUES (%s, %s, %s, %s, %s, %s, %s)
"""

cursor.executemany(insert_query, student_data)
conn.commit()

cursor.close()
conn.close()

print("Inserted student data into 'tblStudent' successfully.")

Inserted student data into 'tblStudent' successfully.

<b>6. Print all rows (only rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks) on screen (as shown in various examples shown above).</b>

In [3]:
import mysql.connector
 
conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

cursor.execute("SELECT rollno, name, DATE_FORMAT(birthdate, '%Y-%m-%d'), gender, cmarks, cppmarks, pythonmarks FROM tblStudent")

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<7} {:<7}".format("Roll No", "Name", "Birthdate", "Gender", "C Marks", "CPP Marks", "Python Marks"))
print("="*78)

for record in student_records:
    rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks = record
    print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<9} {:<7}".format(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks))

cursor.close()
conn.close()

Roll No  Name            Birthdate    Gender   C Marks CPP Marks Python Marks
==============================================================================
1        Aman Khatri     2002-08-29   Male     80      85        70
2        Neha Mishra     2000-03-28   Female   75      89        95
3        Rahul Jogadiya  2001-07-27   Male     90      92        88
4        Payal Sharma    1999-04-25   Female   81      89        78
5        Karan Garle     2002-02-10   Male     95      83        94
6        Pooja Verma     1999-07-18   Female   84      87        85
7        Virat Kohli     1996-11-20   Male     90      92        88
8        Ankita Gandhi   2000-05-08   Female   71      60        72
9        Jaivin Domadiya 2001-08-12   Male     88      91        84
10       Anita Choudhary 2000-01-05   Female   82      83        87

<b>7. Compute & update totalmarks for all rows in table.</b>

In [4]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

compute_total_query = "UPDATE tblStudent SET totalmarks = cmarks + cppmarks + pythonmarks"
cursor.execute(compute_total_query)
conn.commit()

cursor.close()
conn.close()

print("Totalmarks computed and updated successfully for all rows.")

Totalmarks computed and updated successfully for all rows.

<b>8.Compute & update percentage for all rows in table.</b>

In [6]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

compute_percentage_query = "UPDATE tblStudent SET percentage = (cmarks + cppmarks + pythonmarks) / 3"
cursor.execute(compute_percentage_query)
conn.commit()

cursor.close()
conn.close()

print("Percentage computed and updated successfully for all rows.")

Percentage computed and updated successfully for all rows.

<b>9.Compute & update grade for all rows in table.</b>

In [7]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

compute_grade_query = """
    UPDATE tblStudent
    SET grade = CASE
        WHEN percentage >= 90 THEN 'A'
        WHEN percentage >= 80 THEN 'B'
        WHEN percentage >= 70 THEN 'C'
        WHEN percentage >= 60 THEN 'D'
        WHEN percentage >= 50 THEN 'E'
        ELSE 'F'
    END
"""

cursor.execute(compute_grade_query)
conn.commit()

cursor.close()
conn.close()

print("Grade computed and updated successfully for all rows.")

Grade computed and updated successfully for all rows.

<b>10. Print all rows (all columns).</b>

In [8]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_all_query = "SELECT rollno, name, DATE_FORMAT(birthdate, '%Y-%m-%d'), gender, cmarks, cppmarks, pythonmarks,totalmarks, percentage, grade FROM tblStudent"
cursor.execute(select_all_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<7} {:13}{:<7} {:<7} {:<7}".format("Roll No", "Name", "Birthdate", "Gender", "C", "CPP", "Python","Totalmarks", "Percentage", "Grade" ))
print("="*108)


    
for record in student_records:
    rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks, totalmarks, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8} {:<7} {:<9} {:<12} {:<10} {:<10} {:<7}".format(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks, totalmarks, percentage, grade))
 
cursor.close()
conn.close()

Roll No  Name            Birthdate    Gender   C       CPP     Python       Totalmarks Percentage Grade
============================================================================================================
1        Aman Khatri     2002-08-29   Male     80      85        70           235        78.33      C
2        Neha Mishra     2000-03-28   Female   75      89        95           259        86.33      B
3        Rahul Jogadiya  2001-07-27   Male     90      92        88           270        90.00      A
4        Payal Sharma    1999-04-25   Female   81      89        78           248        82.67      B
5        Karan Garle     2002-02-10   Male     95      83        94           272        90.67      A
6        Pooja Verma     1999-07-18   Female   84      87        85           256        85.33      B
7        Virat Kohli     1996-11-20   Male     90      92        88           270        90.00      A
8        Ankita Gandhi   2000-05-08   Female   71      60        72           203        67.67      D
9        Jaivin Domadiya 2001-08-12   Male     88      91        84           263        87.67      B
10       Anita Choudhary 2000-01-05   Female   82      83        87           252        84.00      B

<b>11.Print all rows with only columns: rollno, name, percentage and grade.</b>

In [9]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent"
cursor.execute(select_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8} ".format("Roll No", "Name", "Percentage", "Grade" )) 
print("="*43)
for record in student_records:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8} ".format(rollno, name, percentage, grade))
 

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
1        Aman Khatri     78.33        C
2        Neha Mishra     86.33        B
3        Rahul Jogadiya  90.00        A
4        Payal Sharma    82.67        B
5        Karan Garle     90.67        A
6        Pooja Verma     85.33        B
7        Virat Kohli     90.00        A
8        Ankita Gandhi   67.67        D
9        Jaivin Domadiya 87.67        B
10       Anita Choudhary 84.00        B

<b>12.Print merit list.</b>

In [10]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent ORDER BY percentage DESC"
cursor.execute(select_query)

student_records = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8}".format("Roll No", "Name", "Percentage", "Grade"))
print("=" * 43)

for record in student_records:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8}".format(rollno, name, percentage, grade))

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
5        Karan Garle     90.67        A
3        Rahul Jogadiya  90.00        A
7        Virat Kohli     90.00        A
9        Jaivin Domadiya 87.67        B
2        Neha Mishra     86.33        B
6        Pooja Verma     85.33        B
10       Anita Choudhary 84.00        B
4        Payal Sharma    82.67        B
1        Aman Khatri     78.33        C
8        Ankita Gandhi   67.67        D

<b>13. Print first two toppers.</b>

In [11]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = "SELECT rollno, name, percentage, grade FROM tblStudent ORDER BY percentage DESC LIMIT 2"
cursor.execute(select_query)

toppers = cursor.fetchall()

print("{:<8} {:<15} {:<12} {:<8}".format("Roll No", "Name", "Percentage", "Grade"))
print("=" * 43)

for record in toppers:
    rollno, name, percentage, grade = record
    print("{:<8} {:<15} {:<12} {:<8}".format(rollno, name, percentage, grade))

cursor.close()
conn.close()

Roll No  Name            Percentage   Grade
===========================================
5        Karan Garle     90.67        A
3        Rahul Jogadiya  90.00        A

<b>14.Print girl students who have failed in at least two subjects.</b>

In [12]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Female' AND (cmarks < 40 OR cppmarks < 40 OR pythonmarks < 40)
"""

cursor.execute(select_query)

failed_girls = cursor.fetchall()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

for record in failed_girls:
    rollno, name = record
    print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================

<b>15. Print youngest female topper.</b>

In [13]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Female'
    ORDER BY birthdate ASC, percentage DESC
    LIMIT 1
"""

cursor.execute(select_query)

youngest_female_topper = cursor.fetchone()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

rollno, name = youngest_female_topper
print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================
4        Payal Sharma

<b>16. Print oldest male topper.</b>

In [14]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

select_query = """
    SELECT rollno, name
    FROM tblStudent
    WHERE gender = 'Male'
    ORDER BY birthdate DESC, percentage DESC
    LIMIT 1
"""

cursor.execute(select_query)

oldest_male_topper = cursor.fetchone()

print("{:<8} {:<15}".format("Roll No", "Name"))
print("=" * 27)

rollno, name = oldest_male_topper
print("{:<8} {:<15}".format(rollno, name))

cursor.close()
conn.close()

Roll No  Name
===========================
1        Aman Khatri

<b>17. Change birth month to January who were born in December.</b>

In [16]:
import mysql.connector

conn = mysql.connector.connect(host="localhost", user="root", password="amankhatri", database="dbStudent")
cursor = conn.cursor()

update_query = """
    UPDATE tblStudent
    SET birthdate = DATE_ADD(birthdate, INTERVAL 1 MONTH)
    WHERE MONTH(birthdate) = 12
"""

cursor.execute(update_query)

conn.commit()

cursor.close()
conn.close()

<b>18. Change birthdate of topper student as 01-01-2000.</b>

In [17]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="amankhatri",
    database="dbStudent"
)

cursor = conn.cursor()

select_query = "SELECT MAX(percentage) FROM tblStudent"

cursor.execute(select_query)
max_percentage = cursor.fetchone()[0]

update_query = "UPDATE tblStudent SET birthdate = '2000-01-01' WHERE percentage = %s"

cursor.execute(update_query, (max_percentage,))

conn.commit()

cursor.close()
conn.close()

<b>19. List all students whose birthdate is yet to come in 2023.</b>

In [18]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="amankhatri",
    database="dbStudent"
)

cursor = conn.cursor()

select_students_query = """
    SELECT rollno, name, birthdate
    FROM tblStudent
    WHERE YEAR(birthdate) = 2023
"""

cursor.execute(select_students_query)

results = cursor.fetchall()

print("{:<8} {:<15} {:<12}".format("Roll No", "Name", "Birthdate"))
print("=" * 35)

for row in results:
    rollno, name, birthdate = row
    print("{:<8} {:<15} {:<12}".format(rollno, name, birthdate))

cursor.close()
conn.close()

Roll No  Name            Birthdate
===================================

<b>20. Create a stored procedure for inserting row in table. Show usage of it.</b>

In [ ]:
DELIMITER //

CREATE PROCEDURE InsertStudent(
     IN p_rollno INT,
     IN p_name VARCHAR(255),
     IN p_birthdate DATE,
     IN p_gender VARCHAR(10),
     IN p_cmarks INT,
     IN p_cppmarks INT,
     IN p_pythonmarks INT
)
BEGIN
     INSERT INTO tblStudent(rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks)
     VALUES(p_rollno, p_name, p_birthdate, p_gender, p_cmarks, p_cppmarks, p_pythonmarks);
END;
//

DELIMITER ;

In [23]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="amankhatri",
    database="dbStudent"
)

cursor = conn.cursor()

rollno = 11
name = "Rohit Sharma"
birthdate = "2000-01-01"
gender = "Male"
cmarks = 80
cppmarks = 80
pythonmarks = 80

insert_student_query = "CALL InsertStudent(%s, %s, %s, %s, %s, %s, %s)"

cursor.execute(insert_student_query, (rollno, name, birthdate, gender, cmarks, cppmarks, pythonmarks))
print("Student data inserted")
conn.commit()

cursor.close()
conn.close()

Student data inserted

<b>21. Create a stored procedure for fetching only female student rows. Show usage of it.</b>

In [ ]:
DELIMITER //

CREATE PROCEDURE GetFemaleStudents()
BEGIN
    SELECT * FROM tblStudent WHERE gender = 'Female';
END;
//

DELIMITER ;

In [24]:
import mysql.connector


conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="amankhatri",
    database="dbStudent"
)

cursor = conn.cursor()
cursor.callproc("GetFemaleStudents")
for result in cursor.stored_results():
    details = result.fetchall()
   


for row in details:
    print(row)

cursor.close()
conn.close()

(2, 'Neha Mishra', datetime.date(2000, 3, 28), 'Female', 75, 89, 95, 259, Decimal('86.33'), 'B')
(4, 'Payal Sharma', datetime.date(1999, 4, 25), 'Female', 81, 89, 78, 248, Decimal('82.67'), 'B')
(6, 'Pooja Verma', datetime.date(1999, 7, 18), 'Female', 84, 87, 85, 256, Decimal('85.33'), 'B')
(8, 'Ankita Gandhi', datetime.date(2000, 5, 8), 'Female', 71, 60, 72, 203, Decimal('67.67'), 'D')
(10, 'Anita Choudhary', datetime.date(2000, 1, 5), 'Female', 82, 83, 87, 252, Decimal('84.00'), 'B')

<b>22. Create a stored procedure for fetching student records having grade as a specific parameter given by user. Show usage of it.</b>

In [ ]:
DELIMITER //

CREATE PROCEDURE GetStudentsByGrade(IN p_grade VARCHAR(2))
BEGIN
     SELECT * FROM tblStudent WHERE grade = p_grade;
END;
//

In [26]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="amankhatri",
    database="dbStudent"
)

cursor = conn.cursor()
g = input("Enter grade :")
cursor.callproc("GetStudentsByGrade",[g])

for result in cursor.stored_results():
    details = result.fetchall()

for row in details:
    print(row)

cursor.close()
conn.close()

Enter grade :A
(3, 'Rahul Jogadiya', datetime.date(2001, 7, 27), 'Male', 90, 92, 88, 270, Decimal('90.00'), 'A')
(5, 'Karan Garle', datetime.date(2000, 1, 1), 'Male', 95, 83, 94, 272, Decimal('90.67'), 'A')
(7, 'Virat Kohli', datetime.date(1996, 11, 20), 'Male', 90, 92, 88, 270, Decimal('90.00'), 'A')